""" 05. Альтернативный конструктор

Реализуйте метод from_string(), позволяющий создавать объект из строки формата:
"Bob, 2001-12-03"

"""






s1 = Student.from_string("Bob, 2001-12-03")
print(s1)

# Student: Bob, birth_date: 2001-12-03, ID: 1


